yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/dma/inc/rtl_gdma.h
/*
 * Copyright (c) 2026, Realtek Semiconductor Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*============================================================================*
 *               Define to prevent recursive inclusion
 *============================================================================*/
#ifndef RTL_GDMA_H
#define RTL_GDMA_H

#ifdef __cplusplus
extern "C" {
#endif

/*============================================================================*
 *                        Header Files
 *============================================================================*/
#include "utils/rtl_utils.h"
#if defined (CONFIG_SOC_SERIES_RTL87X2G)
#include "dma/src/rtl87x2g/rtl_gdma_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL87X3E)
#include "dma/src/rtl87x3e/rtl_gdma_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL87X3D)
#include "dma/src/rtl87x3d/rtl_gdma_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL8762J)
#include "dma/src/rtl87x2j/rtl_gdma_def.h"
#endif

/** \defgroup GDMA        GDMA
  * \brief
  * \{
  */

/*============================================================================*
 *                         Constants
 *============================================================================*/
/** \defgroup GDMA_Exported_Constants GDMA Exported Constants
  * \brief
  * \{
  */

/**
 * \defgroup    GDMA_Channel_Num GDMA Channel Num
 * \{
 * \ingroup     GDMA_Exported_Constants
 */

#define GDMA_CH_NUM0             (0)       //!< GDMA channel number0.
#define GDMA_CH_NUM1             (1)       //!< GDMA channel number1.
#define GDMA_CH_NUM2             (2)       //!< GDMA channel number2.
#define GDMA_CH_NUM3             (3)       //!< GDMA channel number3.
#define GDMA_CH_NUM4             (4)       //!< GDMA channel number4.
#define GDMA_CH_NUM5             (5)       //!< GDMA channel number5.
#if (CHIP_GDMA_CHANNEL_NUM >= 9)
#define GDMA_CH_NUM6             (6)       //!< GDMA channel number6.
#define GDMA_CH_NUM7             (7)       //!< GDMA channel number7.
#define GDMA_CH_NUM8             (8)       //!< GDMA channel number8.
#endif
#if (CHIP_GDMA_CHANNEL_NUM >= 10)
#define GDMA_CH_NUM9             (9)       //!< GDMA channel number9.
#endif
#if (CHIP_GDMA_CHANNEL_NUM >= 12)
#define GDMA_CH_NUM10            (10)       //!< GDMA channel number10.
#define GDMA_CH_NUM11            (11)       //!< GDMA channel number11.
#endif
#if (CHIP_GDMA_CHANNEL_NUM >= 24)
#define GDMA_CH_NUM12            (12)       //!< GDMA channel number12.
#define GDMA_CH_NUM13            (13)       //!< GDMA channel number13.
#define GDMA_CH_NUM14            (14)       //!< GDMA channel number14.
#define GDMA_CH_NUM15            (15)       //!< GDMA channel number15.
#define GDMA_CH_NUM16            (16)       //!< GDMA channel number16.
#define GDMA_CH_NUM17            (17)       //!< GDMA channel number17.
#define GDMA_CH_NUM18            (18)       //!< GDMA channel number18.
#define GDMA_CH_NUM19            (19)       //!< GDMA channel number19.
#define GDMA_CH_NUM20            (20)       //!< GDMA channel number20.
#define GDMA_CH_NUM21            (21)       //!< GDMA channel number21.
#define GDMA_CH_NUM22            (22)       //!< GDMA channel number22.
#define GDMA_CH_NUM23            (23)       //!< GDMA channel number23.
#endif
#if (CHIP_GDMA_CHANNEL_NUM >= 33)
#define GDMA_CH_NUM24            (24)       //!< GDMA channel number24.
#define GDMA_CH_NUM25            (25)       //!< GDMA channel number25.
#define GDMA_CH_NUM26            (26)       //!< GDMA channel number26.
#define GDMA_CH_NUM27            (27)       //!< GDMA channel number27.
#define GDMA_CH_NUM28            (28)       //!< GDMA channel number28.
#define GDMA_CH_NUM29            (29)       //!< GDMA channel number29.
#define GDMA_CH_NUM30            (30)       //!< GDMA channel number30.
#define GDMA_CH_NUM31            (31)       //!< GDMA channel number31.
#define GDMA_CH_NUM32            (32)       //!< GDMA channel number32.
#endif

#define IS_GDMA_ChannelNum(NUM)  ((NUM) < CHIP_GDMA_CHANNEL_NUM) //!< Specify the maximum GDMA channel number.

/** End of GDMA_Channel_Num
  * \}
  */

/**
 * \defgroup   GDMA_Data_Transfer_Direction GDMA Data Transfer Direction
 * \{
 * \ingroup    GDMA_Exported_Constants
 */

typedef enum
{
    GDMA_DIR_MemoryToMemory = 0x0,             //!< Configure the direction of GDMA as memory to memory.
    GDMA_DIR_MemoryToPeripheral = 0x1,         //!< Configure the direction of GDMA as memory to peripheral.
    GDMA_DIR_PeripheralToMemory = 0x2,         //!< Configure the direction of GDMA as peripheral to memory.
    GDMA_DIR_PeripheralToPeripheral = 0x3,     //!< Configure the direction of GDMA as peripheral to peripheral.
} GDMADirection_TypeDef;

#define IS_GDMA_DIR(DIR) (((DIR) == GDMA_DIR_MemoryToMemory) || \
                          ((DIR) == GDMA_DIR_MemoryToPeripheral) || \
                          ((DIR) == GDMA_DIR_PeripheralToMemory) || \
                          ((DIR) == GDMA_DIR_PeripheralToPeripheral)) //!< Check if the input parameter is valid.

/** End of GDMA_Data_Transfer_Direction
  * \}
  */

/**
 * \defgroup    GDMA_Source_Incremented_Mode GDMA Source Incremented Mode
 * \{
 * \ingroup     GDMA_Exported_Constants
 */
typedef enum
{
    DMA_SourceInc_Inc = 0x0,        //!< Configure the source address to increment.
#if (GDMA_SUPPORT_ADDRESS_DEC == 1)
    DMA_SourceInc_Dec = 0x1,        //!< Configure the source address to decrement.
#endif
    DMA_SourceInc_Fix = 0x2,        //!< Configure the source address to be fixed.
} GDMASrcInc_TypeDef;

#define IS_GDMA_SourceInc(STATE) (((STATE) == DMA_SourceInc_Inc) || \
                                  ((STATE) == DMA_SourceInc_Dec) || \
                                  ((STATE) == DMA_SourceInc_Fix)) //!< Check if the input parameter is valid.

/** End of GDMA_Source_Incremented_Mode
  * \}
  */

/**
 * \defgroup    GDMA_Destination_Incremented_Mode GDMA Destination Incremented Mode
 * \{
 * \ingroup     GDMA_Exported_Constants
 */
typedef enum
{
    DMA_DestinationInc_Inc = 0x0,    //!< Configure the destination address to increment.
#if (GDMA_SUPPORT_ADDRESS_DEC == 1)
    DMA_DestinationInc_Dec = 0x1,    //!< Configure the destination address to decrement.
#endif
    DMA_DestinationInc_Fix = 0x2,    //!< Configure the destination address to be fixed.
} GDMADestInc_TypeDef;

#define IS_GDMA_DestinationInc(STATE) (((STATE) == DMA_DestinationInc_Inc) || \
                                       ((STATE) == DMA_DestinationInc_Dec) || \
                                       ((STATE) == DMA_DestinationInc_Fix)) //!< Check if the input parameter is valid.

/** End of GDMA_Destination_Incremented_Mode
  * \}
  */

/**
 * \defgroup    GDMA_Data_Size GDMA Data Size
 * \{
 * \ingroup     GDMA_Exported_Constants
 */
typedef enum
{
    GDMA_DataSize_Byte     = 0x0,    //!< Configure the source or destination data size as byte.
    GDMA_DataSize_HalfWord = 0x1,    //!< Configure the source or destination data size as half word.
    GDMA_DataSize_Word     = 0x2,    //!< Configure the source or destination data size as word.
} GDMADataSize_TypeDef;

#define IS_GDMA_DATA_SIZE(SIZE) (((SIZE) == GDMA_DataSize_Byte) || \
                                 ((SIZE) == GDMA_DataSize_HalfWord) || \
                                 ((SIZE) == GDMA_DataSize_Word)) //!< Check if the input parameter is valid.

/** End of GDMA_Data_Size
  * \}
  */

/**
 * \defgroup    GDMA_Msize GDMA Msize
 * \{
 * \ingroup     GDMA_Exported_Constants
 */

