yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/dma/inc/rtl_gdma.h
typedef enum
{
    GDMA_Msize_1   = 0x0,          //!< Configure the number of data items to be transferred as 1.
    GDMA_Msize_4   = 0x1,          //!< Configure the number of data items to be transferred as 4.
    GDMA_Msize_8   = 0x2,          //!< Configure the number of data items to be transferred as 8.
    GDMA_Msize_16  = 0x3,          //!< Configure the number of data items to be transferred as 16.
    GDMA_Msize_32  = 0x4,          //!< Configure the number of data items to be transferred as 32.
    GDMA_Msize_64  = 0x5,          //!< Configure the number of data items to be transferred as 64.
    GDMA_Msize_128 = 0x6,          //!< Configure the number of data items to be transferred as 128.
    GDMA_Msize_256 = 0x7,          //!< Configure the number of data items to be transferred as 256.
} GDMAMSize_TypeDef;

#define IS_GDMA_MSIZE(SIZE) (((SIZE) == GDMA_Msize_1) || \
                             ((SIZE) == GDMA_Msize_4) || \
                             ((SIZE) == GDMA_Msize_8) || \
                             ((SIZE) == GDMA_Msize_16) || \
                             ((SIZE) == GDMA_Msize_32) || \
                             ((SIZE) == GDMA_Msize_64) || \
                             ((SIZE) == GDMA_Msize_128) || \
                             ((SIZE) == GDMA_Msize_256)) //!< Check if the input parameter is valid.

/** End of GDMA_Msize
  * \}
  */

/**
 * \defgroup    GDMA_Interrupts  GDMA Interrupts
 * \{
 * \ingroup     GDMA_Exported_Constants
 */

#define GDMA_INT_Transfer               (BIT0)  //!< The interrupt is generated on GDMA transfer completion to the destination.
#define GDMA_INT_Block                  (BIT1)  //!< The interrupt is generated on GDMA block transfer completion to the destination.
#define GDMA_INT_Error                  (BIT4)  //!< The interrupt is generated when an ERROR response is received from the slave on the SRESP bus during a GDMA transfer.
#if (GDMA_SUPPORT_INT_HAIF_BLOCK == 1)
#define GDMA_INT_Half_Block             (BIT5)  //!< The interrupt is generated on GDMA half block transfer completion to the destination.
#endif

#define IS_GDMA_CONFIG_IT(IT) ((((IT) & 0xFFFFFFE0) == 0x00) && ((IT) != 0x00)) //!< Check if the input parameter is valid.

/** End of GDMA_Interrupts
  * \}
  */

/**
 * \defgroup    GDMA_Multi-block_Mode GDMA Multi-block Mode
 * \{
 * \ingroup     GDMA_Exported_Constants
 */
#define AUTO_RELOAD_WITH_CONTIGUOUS_SAR (BIT31)  //!< Configure the multi-block transfer mode with the source address set to continuous and the destination address set to auto-reload.
#define AUTO_RELOAD_WITH_CONTIGUOUS_DAR (BIT30)  //!< Configure the multi-block transfer mode with the source address set to auto-reload and the destination address set to continuous.
#define AUTO_RELOAD_TRANSFER            (BIT30 | BIT31)  //!< Configure the multi-block transfer mode with the source address set to auto-reload and the destination address set to auto-reload.
#define LLI_WITH_CONTIGUOUS_SAR         (BIT27)  //!< Configure the multi-block transfer mode with the source address set to continuous and the destination address set to LLI.
#define LLI_WITH_AUTO_RELOAD_SAR        (BIT27 | BIT30)  //!< Configure the multi-block transfer mode with the source address set to auto-reload and the destination address set to LLI.
#define LLI_WITH_CONTIGUOUS_DAR         (BIT28)  //!< Configure the multi-block transfer mode with the source address set to LLI and the destination address set to continuous.
#define LLI_WITH_AUTO_RELOAD_DAR        (BIT28 | BIT31)  //!< Configure the multi-block transfer mode with the source address set to LLI and the destination address set to auto-reload.
#define LLI_TRANSFER                    (BIT27 | BIT28)  //!< Configure the multi-block transfer mode with the source address set to LLI and the destination address set to LLI.

#define IS_GDMA_MULTIBLOCKMODE(MODE) (((MODE) == AUTO_RELOAD_WITH_CONTIGUOUS_SAR) || \
                                      ((MODE) == AUTO_RELOAD_WITH_CONTIGUOUS_DAR) || \
                                      ((MODE) == AUTO_RELOAD_TRANSFER) || \
                                      ((MODE) == LLI_WITH_CONTIGUOUS_SAR) || \
                                      ((MODE) == LLI_WITH_AUTO_RELOAD_SAR) || \
                                      ((MODE) == LLI_WITH_CONTIGUOUS_DAR) || \
                                      ((MODE) == LLI_WITH_AUTO_RELOAD_DAR) || \
                                      ((MODE) == LLI_TRANSFER)) //!< Check if the input parameter is valid.

/** End of GDMA_Multi-block_Mode
  * \}
  */

/**
 * \defgroup    GDMA_Multi-Block_Select_Bit GDMA Multi-Block Select Bit
 * \{
 * \ingroup     GDMA_Exported_Constants
 */
#define AUTO_RELOAD_SELECTED_BIT        (BIT30 | BIT31)   //!< The bit for GDMA auto-reload.
#define LLP_SELECTED_BIT                (BIT27 | BIT28)   //!< The bit for GDMA LLI.

/** End of GDMA_Multi-Block_Select_Bit
  * \}
  */

/**
 * \defgroup    GDMA_Suspend_Flag GDMA Suspend Flag
 * \{
 * \ingroup     GDMA_Exported_Constants
 */
#define GDMA_FIFO_STATUS                (BIT(9))                //!< The bit for GDMA fifo status.
#define GDMA_SUSPEND_TRANSMISSSION      (BIT(8))                //!< The bit for GDMA suspend transmisssion.
#define GDMA_SUSPEND_CMD_STATUS         (BIT(2) | BIT(1))       //!< The bit for GDMA suspend command.
#define GDMA_SUSPEND_CHANNEL_STATUS     (BIT(0))                //!< The bit for GDMA suspend channel status.

/** End of GDMA_Suspend_Flag
  * \}
  */

/** End of GDMA_Exported_Constants
  * \}
  */

/*============================================================================*
 *                         Types
 *============================================================================*/
/** \defgroup GDMA_Exported_Types GDMA Exported Types
  * \brief
  * \{
  */

/**
 * \brief       GDMA init structure definition.
 *
 * \ingroup     GDMA_Exported_Types
 */

typedef struct
{
    uint8_t GDMA_ChannelNum;                /*!< Specify the channel number for GDMA.
                                                 This parameter can be set from 0 to 9. Refer to \ref GDMA_Channel_Num. */

    GDMADirection_TypeDef GDMA_DIR;         /*!< Specify transfer direction.
                                                 This parameter can be a value of \ref GDMA_Data_Transfer_Direction. */

    uint32_t GDMA_BufferSize;               /*!< Specify the buffer size(RTL8762G <= 65535, RTL8772F: GDMA1 is 65535 and GDMA2 is 524287).
                                                 The data unit is equal to the configuration set in DMA_PeripheralDataSize
                                                 or DMA_MemoryDataSize members depending in the transfer direction. */

    GDMASrcInc_TypeDef
    GDMA_SourceInc;      /*!< Specify whether the source address register is incremented or not.
                                                 This parameter can be a value of \ref GDMA_Source_Incremented_Mode. */

    GDMADestInc_TypeDef
    GDMA_DestinationInc; /*!< Specify whether the destination address register is incremented or not.
                                                  This parameter can be a value of \ref GDMA_Destination_Incremented_Mode. */

    GDMADataSize_TypeDef GDMA_SourceDataSize; /*!< Specify the source data width.
                                                   This parameter can be a value of \ref GDMA_Data_Size. */

    GDMADataSize_TypeDef GDMA_DestinationDataSize; /*!< Specify the destination data width.
                                                        This parameter can be a value of \ref GDMA_Data_Size. */

