yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/dma/inc/rtl_gdma.h
    GDMAMSize_TypeDef GDMA_SourceMsize;     /*!< Specify items number to be transferred.
                                                 This parameter can be a value of \ref GDMA_Msize. */

    GDMAMSize_TypeDef GDMA_DestinationMsize;/*!< Specify items number to be transferred.
                                                 This parameter can be a value of \ref GDMA_Msize. */

    uint32_t GDMA_SourceAddr;               /*!< Specify the source base address for GDMA Channelx. */

    uint32_t GDMA_DestinationAddr;          /*!< Specify the destination base address for GDMA Channelx. */

    uint32_t GDMA_ChannelPriority;          /*!< Specify the software priority for the GDMA Channelx.
                                                 This parameter can be a value of 0~9(RTL8762G); 0~7 for GDMA1 and 0~15 for GDMA2(RTL8772F). */

    uint32_t GDMA_Multi_Block_Mode;         /*!< Specify the multi block transfer mode. */

    uint32_t GDMA_Multi_Block_Struct;       /*!< Pointer to the first struct of LLI. */

    uint8_t GDMA_Multi_Block_En;            /*!< Enable or disable multi-block function.
                                                 This parameter can be a value of DISABLE or ENABLE. */

    uint8_t GDMA_SourceHandshake;           /*!< Specify the handshake index in source.
                                                 This parameter can be a value of \ref GDMA_Handshake_Type. */

    uint8_t GDMA_DestHandshake;             /*!< Specify the handshake index in Destination.
                                                This parameter can be a value of \ref GDMA_Handshake_Type. */
#if (GDMA_SUPPORT_SECURE_MODE == 1)
    uint8_t GDMA_Secure_En;                 /*!< Enable or disable Secure function. */
#endif

#if (GDMA_SUPPORT_GATHER_SCATTER_FUNCTION == 1)
    uint8_t  GDMA_Gather_En;                /*!< Enable or disable Gather function. NOTE:4 bytes ALIGN.*/
    uint32_t GDMA_GatherCount;              /*!< Specify the GatherCount.NOTE:4 bytes ALIGN.*/
    uint32_t GDMA_GatherInterval;           /*!< Specify the GatherInterval. */
    uint8_t  GDMA_Scatter_En;               /*!< Enable or disable Scatter function. */
    uint32_t GDMA_ScatterCount;             /*!< Specify the ScatterCount. */
    uint32_t GDMA_ScatterInterval;          /*!< Specify the ScatterInterval. */
    uint32_t GDMA_GatherCircularStreamingNum;  /*!< Specify the GatherCircularStreamingNum. */
    uint32_t GDMA_ScatterCircularStreamingNum; /*!< Specify the ScatterCircularStreamingNum. */
#endif

} GDMA_InitTypeDef;

/**
 * \brief       GDMA link list item structure definition.
 *
 * \ingroup     GDMA_Exported_Types
 */

typedef struct
{
    __IO uint32_t SAR;          /*!< Specify the source base address for LLI. */
    __IO uint32_t DAR;          /*!< Specify the destination base address for LLI. */
    __IO uint32_t LLP;          /*!< Specify the next pointer to the struct of LLI. */
    __IO uint32_t CTL_LOW;      /*!< Specify the CTL_LOW register for LLI. */
    __IO uint32_t CTL_HIGH;     /*!< Specify the CTL_HIGH register for LLI. */
} GDMA_LLIDef;

/** End of GDMA_Exported_Types
  * \}
  */

/*============================================================================*
 *                         Functions
 *============================================================================*/
/** \defgroup GDMA_Exported_Functions GDMA Exported Functions
  * \brief
  * \{
  */

/**
 * \brief     Deinitialize the GDMA registers to their default reset values.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_gdma_init(void)
 * {
 *     GDMA_DeInit();
 * }
 * \endcode
 */
void GDMA_DeInit(void);

/**
 * \brief     Initialize the GDMA Channelx according to the specified
 *            parameters in the GDMA_InitStruct.
 *
 * \param[in] GDMA_Channelx    Select the GDMA peripheral. Refer to \ref GDMA_Declaration.
 * \param[in] GDMA_InitStruct  Pointer to a GDMA_InitTypeDef structure which will be initialized.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_gdma_init(void)
 * {
 *     for (uint32_t i = 0; i < UART_TX_GDMA_BUFFER_SIZE; i++)
 *     {
 *         GDMA_SendData_Buffer[i] = 0x10 + i;
 *     }
 *
 *     GDMA_InitTypeDef GDMA_InitStruct;
 *     GDMA_StructInit(&GDMA_InitStruct);
 *     GDMA_InitStruct.GDMA_ChannelNum      = 1;
 *     GDMA_InitStruct.GDMA_DIR             = GDMA_DIR_MemoryToPeripheral;
 *     GDMA_InitStruct.GDMA_BufferSize      = UART_TX_GDMA_BUFFER_SIZE;//determine total transfer size
 *     GDMA_InitStruct.GDMA_SourceInc       = DMA_SourceInc_Inc;
 *     GDMA_InitStruct.GDMA_DestinationInc  = DMA_DestinationInc_Fix;
 *     GDMA_InitStruct.GDMA_SourceDataSize  = GDMA_DataSize_Byte;
 *     GDMA_InitStruct.GDMA_DestinationDataSize = GDMA_DataSize_Byte;
 *     GDMA_InitStruct.GDMA_SourceMsize      = GDMA_Msize_1;
 *     GDMA_InitStruct.GDMA_DestinationMsize = GDMA_Msize_1;
 *     GDMA_InitStruct.GDMA_SourceAddr      = (uint32_t)GDMA_SendData_Buffer;
 *     GDMA_InitStruct.GDMA_DestinationAddr = (uint32_t)(&(UART0->UART_RBR_THR));
 *     GDMA_InitStruct.GDMA_DestHandshake   = GDMA0_Handshake_UART0_TX;
 *     GDMA_InitStruct.GDMA_ChannelPriority = 2;
 *     GDMA_Init(UART_TX_GDMA_CHANNEL, &GDMA_InitStruct);
 *
 *     GDMA_INTConfig(UART_TX_GDMA_CHANNEL_NUM, GDMA_INT_Transfer, ENABLE);
 *
 *     NVIC_InitTypeDef NVIC_InitStruct;
 *     NVIC_InitStruct.NVIC_IRQChannel = UART_TX_GDMA_CHANNEL_IRQN;
 *     NVIC_InitStruct.NVIC_IRQChannelPriority = 3;
 *     NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
 *     NVIC_Init(&NVIC_InitStruct);
 *
 *     GDMA_Cmd(UART_TX_GDMA_CHANNEL_NUM, ENABLE);
 * }
 * \endcode
 */
void GDMA_Init(GDMA_ChannelTypeDef *GDMA_Channelx, GDMA_InitTypeDef *GDMA_InitStruct);

/**
 * \brief     Fill each GDMA_InitStruct member with its default value.
 *
 * \param[in] GDMA_InitStruct  Pointer to a GDMA_InitTypeDef structure which will be initialized.
 *
 * \note   The default settings for the GDMA_InitStruct member are shown in the following table:
 *         | GDMA_InitStruct member      | Default value                      |
 *         |:---------------------------:|:----------------------------------:|
 *         | GDMA_ChannelNum             | \ref GDMA_CH_NUM0                 |
 *         | GDMA_DIR                    | \ref GDMA_DIR_PeripheralToMemory   |
 *         | GDMA_BufferSize             | 200                                |
 *         | GDMA_SourceInc              | \ref DMA_SourceInc_Fix             |
 *         | GDMA_DestinationInc         | \ref DMA_DestinationInc_Inc        |
 *         | GDMA_SourceDataSize         | \ref GDMA_DataSize_Byte            |
 *         | GDMA_DestinationDataSize    | \ref GDMA_DataSize_Byte            |
 *         | GDMA_SourceMsize            | \ref GDMA_Msize_1                  |
 *         | GDMA_DestinationMsize       | \ref GDMA_Msize_1                  |
 *         | GDMA_SourceAddr             | 0                                  |
 *         | GDMA_DestinationAddr        | 0                                  |
 *         | GDMA_ChannelPriority        | 0                                  |
 *         | GDMA_Multi_Block_Mode       | \ref LLI_TRANSFER                  |
 *         | GDMA_SourceHandshake        | 0                                  |
 *         | GDMA_DestHandshake          | 0                                  |
 *         | GDMA_Multi_Block_En         | DISABLE                            |
 *         | GDMA_Scatter_En             | DISABLE                            |
 *         | GDMA_Gather_En              | DISABLE                            |
 *         | GDMA_Source_Cir_Gather_Num  | 1                                  |
 *         | GDMA_Dest_Cir_Sca_Num       | 1                                  |
 *         | GDMA_Multi_Block_Struct     | 0                                  |
 *         | GDMA_ScatterCount           | 0                                  |
 *         | GDMA_ScatterInterval        | 0                                  |
 *         | GDMA_GatherCount            | 0                                  |
 *         | GDMA_GatherInterval         | 0                                  |
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_gdma_init(void)
 * {
 *
 *     for (uint32_t i = 0; i < UART_TX_GDMA_BUFFER_SIZE; i++)
 *     {
 *         GDMA_SendData_Buffer[i] = 0x10 + i;
 *     }
 *
 *     GDMA_InitTypeDef GDMA_InitStruct;
 *     GDMA_StructInit(&GDMA_InitStruct);
 *     GDMA_InitStruct.GDMA_ChannelNum      = 1;
 *     GDMA_InitStruct.GDMA_DIR             = GDMA_DIR_MemoryToPeripheral;
 *     GDMA_InitStruct.GDMA_BufferSize      = UART_TX_GDMA_BUFFER_SIZE;//determine total transfer size
 *     GDMA_InitStruct.GDMA_SourceInc       = DMA_SourceInc_Inc;
 *     GDMA_InitStruct.GDMA_DestinationInc  = DMA_DestinationInc_Fix;
 *     GDMA_InitStruct.GDMA_SourceDataSize  = GDMA_DataSize_Byte;
 *     GDMA_InitStruct.GDMA_DestinationDataSize = GDMA_DataSize_Byte;
 *     GDMA_InitStruct.GDMA_SourceMsize      = GDMA_Msize_1;
 *     GDMA_InitStruct.GDMA_DestinationMsize = GDMA_Msize_1;
 *     GDMA_InitStruct.GDMA_SourceAddr      = (uint32_t)GDMA_SendData_Buffer;
 *     GDMA_InitStruct.GDMA_DestinationAddr = (uint32_t)(&(UART0->UART_RBR_THR));
 *     GDMA_InitStruct.GDMA_DestHandshake   = GDMA0_Handshake_UART0_TX;
 *     GDMA_InitStruct.GDMA_ChannelPriority = 2;
 *     GDMA_Init(UART_TX_GDMA_CHANNEL, &GDMA_InitStruct);
 *
 * }
 * \endcode
 */
void GDMA_StructInit(GDMA_InitTypeDef *GDMA_InitStruct);

/**
 * \brief  Enable or disable the selected GDMA channel.
 *
 * \param[in]  GDMA_ChannelNum  Select the GDMA channel number. Refer to \ref GDMA_Channel_Num.
 * \param[in]  NewState         New state of the selected DMA channel.
 *                              This parameter can be one of the following values:
 *                              - ENABLE: Enable the selected GDMA channel.
 *                              - DISABLE: Disable the selected GDMA channel.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_gdma_init(void)
 * {
 *
 *     for (uint32_t i = 0; i < UART_TX_GDMA_BUFFER_SIZE; i++)
 *     {
 *         GDMA_SendData_Buffer[i] = 0x10 + i;
 *     }
 *
 *     GDMA_InitTypeDef GDMA_InitStruct;
 *     GDMA_StructInit(&GDMA_InitStruct);
 *     GDMA_InitStruct.GDMA_ChannelNum      = 1;
 *     GDMA_InitStruct.GDMA_DIR             = GDMA_DIR_MemoryToPeripheral;
 *     GDMA_InitStruct.GDMA_BufferSize      = UART_TX_GDMA_BUFFER_SIZE;//determine total transfer size
 *     GDMA_InitStruct.GDMA_SourceInc       = DMA_SourceInc_Inc;
 *     GDMA_InitStruct.GDMA_DestinationInc  = DMA_DestinationInc_Fix;
 *     GDMA_InitStruct.GDMA_SourceDataSize  = GDMA_DataSize_Byte;
 *     GDMA_InitStruct.GDMA_DestinationDataSize = GDMA_DataSize_Byte;
 *     GDMA_InitStruct.GDMA_SourceMsize      = GDMA_Msize_1;
 *     GDMA_InitStruct.GDMA_DestinationMsize = GDMA_Msize_1;
 *     GDMA_InitStruct.GDMA_SourceAddr      = (uint32_t)GDMA_SendData_Buffer;
 *     GDMA_InitStruct.GDMA_DestinationAddr = (uint32_t)(&(UART0->UART_RBR_THR));
 *     GDMA_InitStruct.GDMA_DestHandshake   = GDMA0_Handshake_UART0_TX;
 *     GDMA_InitStruct.GDMA_ChannelPriority = 2;
 *     GDMA_Init(UART_TX_GDMA_CHANNEL, &GDMA_InitStruct);
 *
 *     GDMA_INTConfig(UART_TX_GDMA_CHANNEL_NUM, GDMA_INT_Transfer, ENABLE);
 *
 *     NVIC_InitTypeDef NVIC_InitStruct;
 *     NVIC_InitStruct.NVIC_IRQChannel = UART_TX_GDMA_CHANNEL_IRQN;
 *     NVIC_InitStruct.NVIC_IRQChannelPriority = 3;
 *     NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
 *     NVIC_Init(&NVIC_InitStruct);
 *
 *     GDMA_Cmd(UART_TX_GDMA_CHANNEL_NUM, ENABLE);
 * }
 * \endcode
 */
void GDMA_Cmd(uint8_t GDMA_ChannelNum, FunctionalState NewState);

/**
 * \brief   Enable or disable the specified DMA channelx interrupt source.
 *
 * \param[in] GDMA_ChannelNum  Select the GDMA channel number. Refer to \ref GDMA_Channel_Num.
 * \param[in] GDMA_IT          Specify the GDMA interrupt source to be enabled or disabled.
 *                             This parameter can be any combination of the following values.
 *                             Refer to \ref GDMA_Interrupts.
 *                             \arg GDMA_INT_Transfer: Transfer complete interrupt source.
 *                             \arg GDMA_INT_Block: Block transfer interrupt source.
 *                             \arg GDMA_INT_Error: Transfer error interrupt source.
 *                             \arg GDMA_INT_Half_Block: Half Block transfer interrupt source.
 * \param[in] NewState         New state of the specified DMA interrupt source.
 *                             This parameter can be one of the following values:
 *                             - ENABLE: Enable the specified GDMA channelx interrupt source.
 *                             - DISABLE: Disable the specified GDMA channelx interrupt source.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_gdma_init(void)
 * {
 *
 *     for (uint32_t i = 0; i < UART_TX_GDMA_BUFFER_SIZE; i++)
 *     {
 *         GDMA_SendData_Buffer[i] = 0x10 + i;
 *     }
 *
 *     GDMA_InitTypeDef GDMA_InitStruct;
 *     GDMA_StructInit(&GDMA_InitStruct);
 *     GDMA_InitStruct.GDMA_ChannelNum      = 1;
 *     GDMA_InitStruct.GDMA_DIR             = GDMA_DIR_MemoryToPeripheral;
 *     GDMA_InitStruct.GDMA_BufferSize      = UART_TX_GDMA_BUFFER_SIZE;//determine total transfer size
 *     GDMA_InitStruct.GDMA_SourceInc       = DMA_SourceInc_Inc;
 *     GDMA_InitStruct.GDMA_DestinationInc  = DMA_DestinationInc_Fix;
 *     GDMA_InitStruct.GDMA_SourceDataSize  = GDMA_DataSize_Byte;
 *     GDMA_InitStruct.GDMA_DestinationDataSize = GDMA_DataSize_Byte;
 *     GDMA_InitStruct.GDMA_SourceMsize      = GDMA_Msize_1;
 *     GDMA_InitStruct.GDMA_DestinationMsize = GDMA_Msize_1;
 *     GDMA_InitStruct.GDMA_SourceAddr      = (uint32_t)GDMA_SendData_Buffer;
 *     GDMA_InitStruct.GDMA_DestinationAddr = (uint32_t)(&(UART0->UART_RBR_THR));
 *     GDMA_InitStruct.GDMA_DestHandshake   = GDMA0_Handshake_UART0_TX;
 *     GDMA_InitStruct.GDMA_ChannelPriority = 2;
 *     GDMA_Init(UART_TX_GDMA_CHANNEL, &GDMA_InitStruct);
 *
 *     GDMA_INTConfig(UART_TX_GDMA_CHANNEL_NUM, GDMA_INT_Transfer, ENABLE);
 *
 *     NVIC_InitTypeDef NVIC_InitStruct;
 *     NVIC_InitStruct.NVIC_IRQChannel = UART_TX_GDMA_CHANNEL_IRQN;
 *     NVIC_InitStruct.NVIC_IRQChannelPriority = 3;
 *     NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
 *     NVIC_Init(&NVIC_InitStruct);
 *
 *     GDMA_Cmd(UART_TX_GDMA_CHANNEL_NUM, ENABLE);
 * }
 * \endcode
 */
void GDMA_INTConfig(uint8_t GDMA_ChannelNum, uint32_t GDMA_IT, FunctionalState NewState);

/**
 * \brief     Get the GDMA channel transfer interrupt status.
 *
 * \param[in] GDMA_ChannelNum  Select the GDMA channel number. Refer to \ref GDMA_Channel_Num.
 *
 * \return   Transfer interrupt status.
 *          - SET: The GDMA channel transfer interrupt has been set.
 *          - RESET: The GDMA channel transfer interrupt has been reset.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     ITStatus int_status = GDMA_GetTransferINTStatus(GDMA_CH_NUM0);
 * }
 * \endcode
 */
ITStatus GDMA_GetTransferINTStatus(uint8_t GDMA_ChannelNum);

/**
 * \brief  Clear the specified DMA channelx interrupt pending bit.
 *
 * \param[in] GDMA_ChannelNum  Select the GDMA channel number. Refer to \ref GDMA_Channel_Num.
 * \param[in] GDMA_IT          Specify the GDMA interrupts sources to be enabled or disabled.
 *                             This parameter can be any combination of the following values.
 *                             Refer to \ref GDMA_Interrupts.
 *                             - GDMA_INT_Transfer: Transfer complete interrupt source.
 *                             - GDMA_INT_Block: Block transfer interrupt source.
 *                             - GDMA_INT_Error: Transfer error interrupt source.
 *                             - GDMA_INT_Half_Block: Half Block transfer interrupt source.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     driver_gdma_init();
 * }
 *
 * void UART_TX_GDMA_Handler(void)
 * {
 *     GDMA_ClearINTPendingBit(GDMA_CH_NUM1, GDMA_INT_Transfer);
 *     //Add user code here.
 * }
 * \endcode
 */
void GDMA_ClearINTPendingBit(uint8_t GDMA_ChannelNum, uint32_t GDMA_IT);

/**
 * \brief     Clear GDMAx Channelx all type interrupt.
 *
 * \param[in] GDMA_ChannelNum  Select the GDMA channel number. Refer to \ref GDMA_Channel_Num.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     GDMA_ClearAllTypeINT(GDMA_CH_NUM2);
 * }
 * \endcode
 */
void GDMA_ClearAllTypeINT(uint8_t GDMA_ChannelNum);

/**
 * \brief   Get selected GDMA channel status.
 *
 * \param[in] GDMA_ChannelNum  Select the GDMA channel number. Refer to \ref GDMA_Channel_Num.
 *
 * \return  GDMA channel status.
 *          -SET: Channel is be used
 *          -RESET: Channel is free.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     FlagStatus flag_status = GDMA_GetChannelStatus(GDMA_CH_NUM3);
 * }
 * \endcode
 */
FlagStatus GDMA_GetChannelStatus(uint8_t GDMA_ChannelNum);

#if (GDMA_SUPPORT_SECURE_MODE == 1)
/**
 * \brief     Enable or disable the specified DMA channel secure function.
 *
 * \param[in] GDMA_Channelx  Select the GDMA peripheral. Refer to \ref GDMA_Declaration.
 * \param[in] NewState       Specify the GDMA channel secure function.
 *                           This parameter can be one of the following values:
 *                           - ENABLE: Enable the specified DMA channel secure function.
 *                           - DISABLE: Disable the specified DMA channel secure function.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     GDMA_SecureCmd(GDMA_Channel3, ENABLE);
 * }
 *
 * \endcode
 */
void GDMA_SecureCmd(GDMA_ChannelTypeDef *GDMA_Channelx, FunctionalState NewState);
#endif

#if (GDMA_SUPPORT_OSW_OSR_CHANGE == 1)
/**
 * \brief     Set GDMA OSW.
 *
 * \param[in] GDMA_ChannelNum  Select the GDMA channel number. Refer to \ref GDMA_Channel_Num.
 * \param[in] osw_count        Outstanding write count.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     GDMA_SetOSW(GDMA_CH_NUM0, 10);
 * }
 * \endcode
 */
void GDMA_SetOSW(uint8_t GDMA_ChannelNum, uint8_t osw_count);

/**
 * \brief  Set GDMA OSR.
 *
 * \param[in] GDMA_ChannelNum  Select the GDMA channel number. Refer to \ref GDMA_Channel_Num.
 * \param[in] osr_count        Outstanding read count.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     GDMA_SetOSR(GDMA_CH_NUM0, 10);
 * }
 * \endcode
 */
void GDMA_SetOSR(uint8_t GDMA_ChannelNum, uint8_t osr_count);

/**
 * \brief     Get GDMA OSW.
 *
 * \param[in] GDMA_ChannelNum  Select the GDMA channel number. Refer to \ref GDMA_Channel_Num.
 *
 * \return    osw_count: outstanding write count.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     uint32_t osw_count = GDMA_GetOSWCount(GDMA_CH_NUM0);
 * }
 * \endcode
 */
uint8_t GDMA_GetOSWCount(uint8_t GDMA_ChannelNum);

/**
 * \brief     Get GDMA OSR.
 *
 * \param[in] GDMA_ChannelNum  Select the GDMA channel number. Refer to \ref GDMA_Channel_Num.
 *
 * \return    osr_count: outstanding read count.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     uint8_t osr_count = GDMA_GetOSRCount(GDMA_CH_NUM0);
 * }
 * \endcode
 */
uint8_t GDMA_GetOSRCount(uint8_t GDMA_ChannelNum);
#endif

/**
 * \brief     Set GDMA transmission source address.
 *
 * \param[in] GDMA_Channelx  Select the GDMA peripheral. Refer to \ref GDMA_Declaration.
 * \param[in] Address        Source address.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     uint32_t data_buf[10] = {0};
 *     GDMA_SetSourceAddress(GDMA2_Channel0,(uint32_t)data_buf);
 * }
 * \endcode
 */
void GDMA_SetSourceAddress(GDMA_ChannelTypeDef *GDMA_Channelx, uint32_t Address);

/**
 * \brief     Set GDMA transmission destination address.
 *
 * \param[in] GDMA_Channelx  Select the GDMA peripheral. Refer to \ref GDMA_Declaration.
 * \param[in] Address        Destination address.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     uint32_t data_buf[10] = {0};
 *     GDMA_SetDestinationAddress(GDMA_Channel0,(uint32_t)data_buf);
 * }
 * \endcode
 */
void GDMA_SetDestinationAddress(GDMA_ChannelTypeDef *GDMA_Channelx,
                                uint32_t Address);

/**
 * \brief     Set GDMA LLP stucture address.
 *
 * \param[in] GDMA_Channelx  Select the GDMA peripheral. Refer to \ref GDMA_Declaration.
 * \param[in] Address        LLP stucture address.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     GDMA_LLIDef GDMA_LLIStruct[4000];
 *     GDMA_SetLLPAddress(GDMA2_Channel0,(uint32_t)GDMA_LLIStruct);
 * }
 * \endcode
 */
void GDMA_SetLLPAddress(GDMA_ChannelTypeDef *GDMA_Channelx, uint32_t Address);

/**
 * \brief     Set GDMA buffer size.
 *
 * \param[in] GDMA_Channelx  Select the GDMA peripheral. Refer to \ref GDMA_Declaration.
 * \param[in] buffer_size    Set GDMA_BufferSize, max 65535 for RTL8762G (RTL8772F: GDMA1 is 65535 and GDMA2 is 524287).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     uint32_t data_buf_size = 4095;
 *     GDMA_SetBufferSize(GDMA_Channel0,data_buf_size);
 * }
 * \endcode
 */
void GDMA_SetBufferSize(GDMA_ChannelTypeDef *GDMA_Channelx, uint32_t buffer_size);

/**
 * \brief  Get GDMA source address.
 *
 * \param[in] GDMA_Channelx  Select the GDMA peripheral. Refer to \ref GDMA_Declaration.
 *
 * \return Source address.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     uint32_t address = GDMA_GetSrcTransferAddress(GDMA2_Channel0);
 * }
 * \endcode
 */
uint32_t GDMA_GetSrcTransferAddress(GDMA_ChannelTypeDef *GDMA_Channelx);

/**
 * \brief  Get GDMA destination address.
 *
 * \param[in] GDMA_Channelx  Select the GDMA peripheral. Refer to \ref GDMA_Declaration.
 *
 * \return Destination address.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     uint32_t address = GDMA_GetDstTransferAddress(GDMA2_Channel0);
 * }
 * \endcode
 */
uint32_t GDMA_GetDstTransferAddress(GDMA_ChannelTypeDef *GDMA_Channelx);
/**
 * \brief     Get GDMA transfer data length.
 *
 * \param[in] GDMA_Channelx  Select the GDMA peripheral. Refer to \ref GDMA_Declaration.
 *
 * \return    GDMA transfer data length.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     uint16_t data_len = GDMA_GetTransferLen(GDMA2_Channel0);
 * }
 * \endcode
 */
uint16_t GDMA_GetTransferLen(GDMA_ChannelTypeDef *GDMA_Channelx);

/**
 * \brief     Check GDMA FIFO status.
 *
 * \param[in] GDMA_Channelx  Select the GDMA peripheral. Refer to \ref GDMA_Declaration.
 *
 * \return GDMA FIFO status.
 *         - SET: FIFO empty.
 *         - RESET: FIFO not empty.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     FlagStatus flag_status = GDMA_GetFIFOStatus(GDMA2_Channel0);
 * }
 * \endcode
 */
FlagStatus GDMA_GetFIFOStatus(GDMA_ChannelTypeDef *GDMA_Channelx);

/**
 * \brief     Suspend GDMA transmission from the source.
 *
 * \param[in] GDMA_Channelx  Select the GDMA peripheral. Refer to \ref GDMA_Declaration.
 * \param[in] NewState       New state of the GDMAx Channelx.
 *                           This parameter can be one of the following values:
 *                           - ENABLE: Enable suspend GDMA transmission.
 *                           - DISABLE: Disable suspend GDMA transmission.
 *
 * \note       To prevent data loss, it is necessary to check whether FIFO data transmission is completed
 *             after suspend, and judge by checking whether GDMA FIFO is empty.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     GDMA_SuspendCmd(GDMA2_Channel0, ENABLE);
 * }
 * \endcode
 */
void GDMA_SuspendCmd(GDMA_ChannelTypeDef *GDMA_Channelx,
                     FunctionalState NewState);

