yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/dma/inc/rtl_gdma.h
/**
 * \brief     Get GDMA Channelx of the specified DMA Channel Number.
 *
 * \param[in] GDMA_ChannelNum  Select the GDMA channel number. Refer to \ref GDMA_Channel_Num.
 *
 * \return    GDMA_Channelx.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_gdma_init(void)
 * {
 *     uint8_t channel_num = GDMA_CH_NUM0;
 *     GDMA_ChannelTypeDef *GDMA_Channelx = GDMA_GetGDMAChannelx(channel_num);
 * }
 * \endcode
 */
GDMA_ChannelTypeDef *GDMA_GetGDMAChannelx(uint8_t GDMA_ChannelNum);

/**
 * \brief  Update GDMA LLP mode in multi-block.
 *
 * \param[in] GDMA_Channelx  Select the GDMA peripheral. Refer to \ref GDMA_Declaration.
 * \param[in] mode           GDMA LLP mode.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     GDMA_SetLLPMode(GDMA_Channel0, LLI_TRANSFER);
 * }
 * \endcode
 */
void GDMA_SetLLPMode(GDMA_ChannelTypeDef *GDMA_Channelx, uint32_t mode);

/**
 * \brief  Suspend GDMA transmission safe from the source. Please check GDMA FIFO empty to guarnatee without losing data.
 *
 * \param[in] GDMA_Channelx  Select the GDMA peripheral. Refer to \ref GDMA_Declaration.
 *
 * \return The result of suspend GDMA transmission.
 *         - true: suspend GDMA transmission success.
 *         - false: suspend GDMA transmission failed.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     GDMA_SafeSuspend(GDMA_Channel0);
 * }
 * \endcode
 */
bool GDMA_SafeSuspend(GDMA_ChannelTypeDef *GDMA_Channelx);

/** End of GDMA_Exported_Functions
  * \}
  */

/** End of GDMA
  * \}
  */

#ifdef __cplusplus
}
#endif

#endif /* RTL_GDMA_H */


